### OpenTofu `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.cloud-storage.google_storage_bucket.bucket will be created
+   resource "google_storage_bucket" "bucket" {
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-CENTRAL1"
+       name                        = "error-reports-resume-staging"
+       project                     = (known after apply)
+       project_number              = (known after apply)
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       uniform_bucket_level_access = (known after apply)
+       url                         = (known after apply)

+       versioning {
+           enabled = true
        }
    }

  # module.firestore.google_firestore_database.firestore_database will be created
+   resource "google_firestore_database" "firestore_database" {
+       app_engine_integration_mode       = (known after apply)
+       concurrency_mode                  = (known after apply)
+       create_time                       = (known after apply)
+       delete_protection_state           = (known after apply)
+       deletion_policy                   = "DELETE"
+       earliest_version_time             = (known after apply)
+       etag                              = (known after apply)
+       id                                = (known after apply)
+       key_prefix                        = (known after apply)
+       location_id                       = "nam5"
+       name                              = "(default)"
+       point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
+       project                           = "resumejson-staging"
+       type                              = "FIRESTORE_NATIVE"
+       uid                               = (known after apply)
+       update_time                       = (known after apply)
+       version_retention_period          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>